'use strict';

import React from 'react';
import PropTypes from 'prop-types';
import {connect} from 'react-redux';
import {injectIntl, defineMessages, FormattedMessage} from 'react-intl';
import {withComponentExtended, withTools} from '../../../hoc';
import {messages as masterMessages} from "../../../master/masterMessages";
import Helmet from 'react-helmet';
import {withRouter, Link, NavLink} from 'react-router-dom';
import {messages as navigationMessages} from "../../../master/navigation/navigationMessages";
import {messages as helpMessages} from "../../../help/helpMessages";

class TermsOfUseContainer extends React.Component {


    render() {
        let {intl, routeResolver} = this.props;

        return <div className="docs">
            <Helmet>
                <title>
                    {intl.formatMessage(masterMessages.pageTitle, {title: intl.formatMessage(messages.pageTitle)})}
                </title>
            </Helmet>
            <h1>{intl.formatMessage(messages.pageTitle)}</h1>
            <div>
                <div>
                    <h3>Зміст</h3>
                    <ol>
                        <li><a href="#sec1">Загальні положення</a></li>
                        <li><a href="#sec2">Розміщення оголошень</a></li>
                        <li><a href="#sec3">Умови обробки персональних даних користувачів та згода на обробку</a></li>
                        <li><a href="#sec4">Відомості, що надаються користувачем</a></li>
                        <li><a href="#sec5">Причина видалення оголошень</a></li>
                        <li><a href="#sec6">Права та обов'язки сторін</a></li>
                        <li><a href="#sec7">Обмеження відповідальності</a></li>
                        <li><a href="#sec8">Термін дії угоди і припинення надання послуг сайту</a></li>
                        <li><a href="#sec9">Внесення змін до угоди</a></li>
                        <li><a href="#sec10">Інші умови</a></li>
                    </ol>
                </div>
                <h3 id="sec1">1. Загальні положення</h3>

                <p>1.1 Сервіс Лібребі (далі Виконавець та/або Компанія) публікує цей Публічний договір (Угода та/або
                    Оферта) про надання послуг на інтернет-сайті Виконавця <a
                        href="https://www.liberbee.com">https://www.liberbee.com</a></p>
                <p>1.2 Відповідно до статті 633 Цивільного Кодексу України (ЦК України) ця Угода є публічним договором,
                    і в разі прийняття (акцепту) викладених нижче умов будь-яка дієздатна фізична або юридична особа
                    (далі Користувач) зобов'язується виконувати умови цієї Угоди.</p>
                <div>1.3 У цій оферті, якщо зміст не вимагає іншого, наведені нижче терміни вживаються у такому
                    значенні:
                    <ul>
                        <li><b>Оферта</b> - публічна пропозиція Виконавця, адресована будь-якій дієздатній фізичній
                            та/або юридичній особі, укласти з ним Публічний договір про надання послуг на умовах, що
                            містяться в цій Угоді, зважаючи на всі додатки;
                        </li>
                        <li><b>Акцепт</b> - повне прийняття Користувачем умов Угоди;</li>
                        <li><b>Виконавець</b> - онлайн сервіс (далі Сайт);</li>
                        <li><b>Сайт</b> - інтернет-сайт <a
                            href="https://www.liberbee.com">https://www.liberbee.com</a> який представляє собою
                            комунікаційну платформу для розміщення тимчасових чи довготривалих оголошень/пропозицій з
                            обміну або дарунку книг (далі по тексту - Сайт);
                        </li>
                        <li><b>Користувач</b> - будь-яка дієздатна фізична або юридична особа, яка прийняла умови цієї
                            Угоди та користується послугами Компанії. Від імені юридичної особи користування Сайтом
                            здійснюється уповноваженим співробітником / представником такої юридичної особи;
                        </li>
                        <li><b>Книга</b> - книга чи друковане видання якою володіє Користувач і висловлює свою згоду на
                            публічне розміщення оголошення з Обміну або Дарунку фізичного примірника який знаходиться в
                            його володінні;
                        </li>
                        <li><b>Обмін</b> - дія з обміну книжками які є публічно виставленні в Обліковому записі одного з
                            користувачів з іншим зареєстрованим Корситувачем сайту;
                        </li>
                        <li><b>Послуги/сервіс Liberbee.com</b> - будь-які платні та безкоштовні сервіси, що надаються
                            Виконавцем за допомогою Сайтів (наприклад, в тому числі, але не виключно, всіх його
                            можливостей, тексту, даних, інформації, програмного забезпечення, графіків або фотографій,
                            малюнків і т. д. і т.п.), та будь-яких інших послуг, що надаються Компанією за допомогою
                            сервісів Сайтів;
                        </li>
                        <li><b>Обліковий запис</b> - електронний кабінет Користувача на Сайті, за допомогою якого він
                            може керувати своїми оголошеннями на Сайті. Обліковий запис призначений для користування
                            тільки одиним Користувачем, передача даних для доступу до свого облікового запису іншому
                            користувачеві (іншій особі) не допускається;
                        </li>
                        <li><b>Реєстрація</b> - прийняття Користувачем оферти на укладання цієї Угоди і процедура, в
                            ході якої Користувач за допомогою заповнення відповідних форм Сайту надає необхідну
                            інформацію для використання сервісу Сайту. Реєстрація вважається завершеною тільки в разі
                            успішного проходження всіх її етапів відповідно до опублікованих на Сайті інструкцій;
                        </li>
                        <li><b>Персональні дані</b> - це відомості чи сукупність відомостей про фізичну особу, яка за їх
                            допомогою ідентифікована або може бути конкретно ідентифікована;
                        </li>
                        <li><b>Розміщення</b> - це дія <b>Користувача</b> - публікація, або активація одного
                            оголошення. Розміщенням також є зміна існуючого оголошення, якщо така зміна передбачає зміну
                            істотних характеристик Книги;
                        </li>
                    </ul>
                </div>
                <p>1.4 Якщо Користувач не згоден з цією Угодою повністю або частково, Виконавець просить його залишити
                    цей сайт. Ці умови регулюють використання Користувачем Сайту та послуг Liberbee.com.
                    Використання послуг Сайту Liberbee.com означає, що Користувач ознайомлений з цією Угодою,
                    розуміє і приймає її умови.</p>
                <p>1.5 Починаючи використовувати будь-який сервіс Liberbee.com або пройшовши процедуру реєстрації,
                    Користувач підтверджує свою дієздатність та прийняття умов Угоди в повному обсязі, без будь-яких
                    застережень і винятків. У разі незгоди Користувача з будь-яким з положень цієї Угоди, Користувач
                    не має права використовувати сервіси Liberbee.com.</p>
                <p>1.6 Компанія пропонує Користувачеві послуги з використання Сайтів для розміщення інформації про книги
                    з метою, в тому числі, але не виключно, подальшої їх обміну, купівлі або продажу іншими
                    Користувачами.</p>
                <p>1.7 Всі угоди укладаються між Користувачами безпосередньо. Таким чином, Компанія не є учасником угод
                    Користувачів, а лише надає комунікаційну торговельну платформу для розміщення оголошень.</p>

                <h3 id="sec2">2. Розміщення оголошень</h3>

                <p>2.1 Користувач отримує право розміщувати оголошення на Сайті після заповнення спеціальної
                    форми із зазначенням відповідних параметрів запропонованої книги.
                </p>
                <p>2.2 Користувач також має право зареєструватися на Сайтах з метою отримання додаткових
                    сервісів, заповнивши формуляр із зазначенням дійсної електронної адреси, до якої має
                    доступ тільки користувач, а також інших даних, необхідних для реєстрації. Після цього
                    Користувач отримує електронний лист з підтвердженням реєстрації, що містить посилання,
                    перехід за яким необхідний для завершення реєстрації.
                </p>
                <p>2.3 Користувач має право створити обліковий запис і увійти на Сайт, використовуючи дані
                    облікового запису в Facebook чи Google. Реєструючись на Сайті через через Facebook чи
                    Google, Користувач надає Компанії додаткові персональні дані.
                </p>
                <p>2.4 Використання можливостей Сайту, як зареєстрованими так і незареєстрованими Користувачами
                    означає прийняття зобов'язань дотримуватися правил та інструкцій щодо користування
                    послугами Liberbee.com, в тому числі цієї Угоди.
                </p>
                <p>2.5 Користувач несе відповідальність за всі дії з використанням його електронної адреси та
                    пароля для входу на Сайти. Користувач має право користуватися сервісом Сайту тільки за
                    допомогою власної електронної адреси та пароля. У разі передачі даних для доступу до
                    облікового запису/аккаунта іншому користувачеві (іншій особі), такий обліковий
                    запис/акаунт може бути заблокований на розсуд Адміністрації.
                </p>
                <p>2.6 Користувач зобов'язується зберігати конфіденційність пароля і не розкривати/передавати
                    його третім особам.
                </p>
                <p>2.7 Користувач, який розміщує оголошення про продаж товарів або послуг на Сайті,
                    зобов'язується розмістити інформацію про них відповідно до цієї Угоди та інструкцій,
                    представлених на Сайті та надати точну і повну інформацію про книгу та умови її продажу.
                    Розміщуючи інформацію про книгу, Користувач підтверджує, що він має право продавати цю
                    книгу або обмінювати її відповідно до вимог законодавства країни, в якиій це
                    здійснюється дана дія.
                </p>
                <p>2.8 Користувач гарантує, що запропонована ним книга відповідає опису і характеристикам
                    поданим в публічному оголошенні і вільна від претензій третіх осіб.
                </p>
                <p>2.9 Компанія має право перемістити, завершити або продовжити термін оголошення Користувача з
                    технічних причин, що знаходяться під контролем або поза контролем Компанії. Компанія має
                    право припинити демонстрацію оголошення, якщо Користувач зареєстрував оголошення про
                    книгу, з порушенням умов цієї Угоди або чинного законодавства.
                </p>
                <div>2.10 Користувачу заборонено:
                    <ul>
                        <li>Публікувати однакові оголошення з однієї адреси електронної пошти;</li>
                        <li>Публікувати схожі за змістом оголошення, де очевидно, що мова йде про ту саму
                            книгу;
                        </li>
                        <li>Дублювати однакові оголошення з різних адрес електронної пошти;</li>
                        <li>Публікувати оголошення, в яких назва книги чи видання не відповідає фізичному
                            примірнику;
                        </li>
                        <li>Публікувати оголошення, опис і/або заголовок/фотографії яких є непов'язаними, не
                            розбірливими;
                        </li>
                    </ul>
                </div>
                <p>2.11 Оголошення можуть проходити вибіркову перевірку (модерацію) представниками Компанії, як
                    перед, так і після розміщення.
                </p>
                <p>2.12 Компанія має право видаляти оголошення на вимогу правовласника або компетентних
                    державних органів. Компанія також залишає за собою право видаляти будь-які оголошення,
                    які на її думку не відповідають принципам та засадам суспільної моралі. Рішення про
                    видалення є остаточним і оскарженню не підлягає.
                </p>
                <div>2.13 Адміністрація та модератори Сайту (представники Компанії) мають право:
                <ul>
                    <li>Вносити в текст оголошення Користувача виправлення, що стосуються орфографії і
                        пунктуації, які не впливають на загальний зміст оголошення;
                    </li>
                    <li>Переносити оголошення в інші категрії Сайту у разі виявлення більш точної
                        категорії для їх розміщення;
                    </li>
                </ul>
                </div>
                <p>2.14 Компанія не несе відповідальності за зміст оголошень або гіперпосилань на ресурси,
                    зазначені в описі повідомлень користувачів;
                </p>


                <h3 id="sec3">3. Умови обробки персональних даних користувачів та згода на обробку</h3>

                <p>3.1 У разі розміщенні оголошень користувачі Сайту надають Компанії право на обробку їх
                    персональних даних на умовах, передбачених в <Link
                        to={routeResolver.buildRouteFor('privacyPolicy', {}, {redirect: true})}>{intl.formatMessage(navigationMessages.privacy)}</Link> до
                    цієї Угоди.
                </p>

                <h3 id="sec4">4. Відомості, що надаються користувачем</h3>

                <p>4.1 Компанія зберігає за собою право зв'язуватися з Користувачем: направляти інформаційні
                    повідомлення на електронну та фізичну адресу, вказану при реєстрації.
                </p>
                <p>4.2 Збір інформації здійснюється шляхом самостійного, з використанням програмних засобів
                    Сайту, зазначення Користувачем відповідних даних, необхідних для розміщення оголошень на
                    ньому.
                </p>
                <p>4.3 Інформація технічного характеру, що міститься в системі, наприклад, ip-адреса,
                    відповідно до загальних правил інтернет-повідомлень, використовується Компанією з метою
                    агрегації загальної статистичної, демографічної інформації.
                </p>
                <div>4.4 Користувачеві забороняється надавати інформацію з порушенням умов цієї Угоди або прав
                    третіх осіб, зокрема, інформація не повинна містити:
                <ul>
                    <li>дані, що порушують особисті (немайнові) права, або права інтелектуальної
                        власності третіх осіб;
                    </li>
                    <li>інформацію, що носить характер порнографії;</li>
                    <li>інформацію, що завдає шкоди неповнолітнім;</li>
                    <li>віруси або будь-які інші технології, що можуть завдати шкоди Сайту, Компанії,
                        або іншим користувачам;
                    </li>
                    <li>інформацію, що вважається аморальною, такою як: проституція, або інші форми, що
                        суперечать нормам моралі або закону;
                    </li>
                    <li>інформацію, що представляє собою «спам» або комерційну рекламу;</li>
                    <li>інформацію, що іншим чином порушує законодавство країни, для якої призначене
                        оголошення.
                    </li>
                </ul>
                </div>

                <h3 id="sec5">5. Причини видалення оголошень</h3>

                <div>5.1 Оголошення Користувача може бути видалено Компанією через порушення Користувачем умов
                    цієї Угоди, та з таких причин:
                <ul>
                    <li>книга була деактивована Адміністрацією;</li>
                    <li>у Користувача вже є на Сайті активне аналогічне оголошення;</li>
                    <li>інформація, що міститься в оголошенні, суперечить цій Угод та/або
                        законодавству;
                    </li>
                    <li>інформація, що міститься в оголошенні є неправдивою;</li>
                    <li>заголовок оголошення не відповідає назві фізичному примірнику;</li>
                    <li>фотографія не відповідає зображенню на фізичному примірнику;</li>
                    <li>фотографія містить будь-яку рекламну інформацію;</li>
                    <li>фотографія поганої якості, зображувана обкладинка невиразний;</li>
                    <li>книга додана в категорію, яка не відповідає змісту книги;</li>
                    <li>компанії надано скаргу від власника майнових прав інтелектуальної власності,
                        та/або запит уповноваженого органу державної влади;
                    </li>
                    <li>компанії надано обґрунтована скарга іншого Користувача про порушення його прав в
                        оголошенні;
                    </li>
                </ul>
                </div>

                <h3 id="sec6">6. Права та обов'язки сторін</h3>

                <p>6.1 Всі об'єкти, доступні за допомогою сервісів Компанії, у тому числі елементи дизайну,
                    текст, графічні зображення, ілюстрації, відео, комп’ютерні програми, бази даних, звуки і
                    інші об'єкти, а також будь-який контент, розміщений на сервісах Сайту, є об'єктами
                    виключних прав Компанії, Користувачів та інших правовласників.
                </p>
                <p>6.2 Використання контенту, та будь-яких інших елементів сервісів можливо тільки в рамках
                    функціоналу, пропонованого сервісом Сайту. Ніякі елементи змісту Сайту, а також
                    будь-який контент, розміщений на Сайті, не можуть бути використані іншим чином без
                    попереднього дозволу правовласника. Під використанням мається на увазі, в тому числі,
                    але не виключно: <b>відтворення, копіювання, переробка, поширення на будь-якій основі і
                        т.д.</b></p>
                <p>6.3 Щоб надати Компанії право публікувати відомості, надані Користувачем, Користувач надає
                    Компанії чинне повсюдно (територіально необмежене), безстрокове, безвідкличне,
                    невиключне, суб- ліцензоване право на використання, публікацію, збір, демонстрацію,
                    копіювання, дублювання, відтворення, доведення до загального відома щодо об’єктів
                    авторських прав, публікацій та баз даних, якими володіє Користувач, а також щодо наданих
                    їм відомостей, зображень і фотографій на всіх відомих або невідомих інформаційних
                    носіях. Перераховані вище права надаються Компанії безоплатно (без виплати винагороди).
                    При цьому Користувач зберігає всі майнові права на зміст інформації, що розміщується в
                    оголошенні. Крім переліченого, Користувач надає право на доступ до розміщеної ним
                    інформації всім користувачам Сайтів. Користувач погоджується з тим, що текст оголошень,
                    фотографії, і інші матеріали, додані до оголошення, можуть бути використані Компанією
                    при підготовці рекламних матеріалів, статей, звітів, аналізів і т.д., і
                    використовуватися Компанією на власний розсуд без додаткової згоди з боку Користувача,
                    без виплати винагороди.
                </p>
                <p>6.4 Скориставшись сервісом Сайту, Користувач підтверджує, що несе особисту відповідальність
                    за зміст розміщених ним оголошень, а також володіє всіма необхідними правами на
                    розміщення інформації в оголошенні на Сайті.
                </p>
                <div>6.5 Користувач зобов'язується:
                <ul>
                    <li>не вчиняти дій, які можуть призвести до непропорційно великого навантаження на
                        інфраструктуру Сайту;
                    </li>
                    <li>не використовувати автоматичні програми для отримання доступу до Сайту без
                        дозволу на це Компанії;
                    </li>
                    <li>не копіювати, не відтворювати, не змінювати, не поширювати і не представляти
                        громадськості будь-яку інформацію, що міститься на Сайті (крім відомостей,
                        наданих самим Користувачем) без попереднього письмового дозволу Компанії;
                    </li>
                    <li>не використовувати відомості, надані іншими Користувачами, в інших цілях, окрім
                        як для здійснення угоди безпосередньо з цим Користувачем, без письмового дозволу
                        іншого Користувача. В цей пункт Угоди не включені персональні дані Користувача,
                        які останній надає Компанії при реєстрації.
                    </li>
                </ul>
                </div>
                <div>6.6 Користувачу забороняється:
                <ul>
                    <li>обговорення дій модераторів і адміністрації Сайту іншим чином, окрім як за
                        допомогою електронного листування з модераторами;
                    </li>
                    <li>використання імен Користувачів, схожих на імена інших Користувачів, з метою
                        видати за них себе і писати повідомлення від їх імені;
                    </li>
                </ul>
                </div>
                <p>6.7 Доступ до персональних даних Користувача з боку інших Користувачів можливий тільки при
                    наявності письмової згоди Користувача на подібний доступ або на виконання вимог
                    відповідного законодавства.
                </p>
                <p>6.8 Компанія може періодично встановлювати обмеження щодо використання Сайту. Компанія має
                    право в будь-який момент змінити або припинити роботу, не несучи при цьому
                    відповідальності за подібні зміни або припинення.
                </p>
                <p>6.9 Компанія має право на власний розсуд не приймати, видаляти або переміщувати будь-яке
                    розміщене на Сайті оголошення за порушення цієї Угоди.
                </p>

                <h3 id="sec7">7. Обмеження відповідальності</h3>

                <p>7.1 Скориставшись сервісом Сайту, Користувач підтверджує свою згоду з тим, що він
                    використовує Сайт і його сервіси на свій страх і ризик «як є», оцінює і несе всі ризики,
                    пов'язані з використанням розміщених на Сайті оголошень, а Компанія, в тому числі її
                    керівництво, співробітники і агенти, не несуть ніякої відповідальності за зміст
                    розміщених на Сайті оголошень, за будь-які збитки і втрати, які стали результатом
                    використання розміщених на Сайтах оголошень <b>Користувача</b> та інші дані.
                </p>
                <p>7.2 Компанія не є організатором/ініціатором угоди між Користувачами, або її стороною. Сайт є
                    комунікаційною платформою, яка надає можливість Користувачам розміщувати для обміну,
                    продажу і купівлікниги в будь-який час, звідки завгодно і за будь-якою ціною.
                </p>
                <p>7.3 Компанія не може контролювати достовірність інформації, яка розміщується користувачами в
                    оголошеннях. Компанія не несе відповідальності за будь-які збитки, завдані в результаті
                    вчинення правочину, або неналежної поведінки будь-якої зі сторін угоди.
                </p>
                <p>7.4 Компанія не несе відповідальності за поведінку Користувачів, або за пропоновані ними
                    книги, зазначені в оголошеннях. Всі суперечки і конфлікти між Користувачами вирішуються
                    ними самостійно без залучення Компанії.
                </p>
                <p>7.5 Компанія не несе відповідальності за будь-який несанкціонований доступ або використання
                    серверів Компанії та/або будь-якої інформації про користувачів, що на них зберігається,
                    а також за будь-які помилки, віруси і т.д., які можуть бути передані на Сайт або через
                    Сайт третіми особами.
                </p>
                <p>7.6 Якщо у Користувача виникають претензії до іншого Користувача в результаті використання
                    останнім послуг Сайту, Користувач погоджується пред'являти ці вимоги самостійно і без
                    втручання з боку Компанії, а також звільняє Компанію (поряд з її дочірніми компаніями,
                    афільованими особами, службовцями, директорами, уповноваженими і співробітниками) від
                    всіх вимог, зобов'язань, компенсацій по відшкодуванню збитків, витрат (затрат),
                    включаючи адвокатські гонорари, відомих або невідомих, що виникли в результаті, або у
                    зв'язку з такими вимогами.
                </p>
                <p>7.7 Бездіяльність з боку Компанії в разі порушення Користувачем, або іншими Користувачами
                    положень Угоди не позбавляє Компанію права здійснювати відповідні дії на захист своїх
                    інтересів пізніше, а також не означає відмову Компанії від своїх прав, в разі здійснення
                    подібних порушень в подальшому.
                </p>
                <p>7.8 Компанія не несе відповідальності за неполадки в роботі Сайтів, викликані технічними
                    перебоями в роботі устаткування і програмного забезпечення.
                </p>
                <p>7.9 Ні за яких умов Компанія, її керівництво, співробітники та агенти, які не несуть
                    відповідальності за прямі, непрямі збитки і виплачені штрафні санкції будь-якого
                    характеру (навіть якщо Компанія була попереджена про можливість таких збитків) в
                    результаті використання Сайту і його сервісів Користувачем, включаючи без обмеження
                    випадки, в яких збитки/шкода стала результатом використання або неправильного
                    використання Сайту і його сервісів.
                </p>
                <p>7.10 Ніщо в Угоді не може розумітися як встановлення між Користувачем та Компанією агентських
                    відносин, відносин товариства, відносин по спільній діяльності, трудових відносин, або
                    якихось інших відносин, прямо не передбачених Угодою.
                </p>
                <p>7.11 Компанія несе відповідальність за рекламу, розміщену на сервісах Сайту.</p>

                <h3 id="sec8">8. Термін дії угоди і припинення надання послуг сайту</h3>

                <p>8.1 Ця Угода набуває чинності з моменту початку використання Користувачем сервісу Сайту або
                    з моменту реєстрації Користувача на Сайті, і діє безстроково.
                </p>
                <p>8.2 Користувач має право припинити свою реєстрацію на Сайті в односторонньому порядку, без
                    попереднього повідомлення про це Компанії і пояснення причин.
                </p>
                <p>8.3 У разі якщо Компанією були внесені будь-які зміни до Угоди в порядку, передбаченому
                    пунктом 10.1. Угоди, з якими Користувач не згоден, він зобов'язаний припинити
                    використання сервісів Сайтів. Факт продовження використання Сайтів є підтвердженням
                    згоди Користувача з відповідною редакцією Угоди.
                </p>
                <div>8.4 Розірвання Угоди з боку Компанії може статися у випадках:
                <ul>
                    <li>порушення положень цієї Угоди, нанесення будь-якої шкоди Компанії, в тому числі
                        її репутації, або користувачам Liberbee.com;
                    </li>
                    <li>інших дій, які суперечать політиці Компанії;</li>
                </ul>
                </div>
                <p>8.5 Правові відносини можуть бути відновлені тільки після прийняття адміністрацією Компанії
                    відповідного рішення.
                </p>

                <h3 id="sec9">9. Внесення змін до угоди</h3>

                <p>9.1 Угода може бути змінена Компанією без будь-якого спеціального повідомлення, нова
                    редакція Угоди вступає в силу з моменту її розміщення на Сайті. Чинна редакція Угоди
                    завжди знаходиться на сторінці за адресою <Link
                        to={routeResolver.buildRouteFor('terms', {}, {redirect: true})}>{routeResolver.buildRouteFor('terms', {}, {absolute: true}).absolutePathname}</Link>
                </p>

                <h3 id="sec10">10. Інші умови</h3>

                <p>10.1 При виникненні між Сторонами суперечок та розбіжностей за цією Угодою або у зв'язку з
                    нею, Сторони зобов'язуються вирішувати їх шляхом переговорів. Якщо будь-які суперечки,
                    розбіжності або вимоги, що виникають з приводу цієї Угоди або в зв'язку з нею, у тому
                    числі, що стосуються її виконання, порушення, припинення, або недійсності, не можуть
                    бути вирішені шляхом переговорів, то ці суперечки розглядаються відповідно до чинного
                    законодавством в судовому порядку.
                </p>
                <p>10.2 Ця Угода регулюється і тлумачиться відповідно до законодавства України. Питання, не
                    врегульовані цією Угодою, підлягають вирішенню відповідно до чинного законодавства
                    України. Всі можливі суперечки, що випливають з відносин, що регулюються цією Угодою,
                    вирішуються в порядку, встановленому законодавством України, за нормами права України.
                </p>
                <p>10.3 Скрізь по тексту цієї Угоди, якщо не зазначене інше, під термінами «чинне
                    законодавство», «застосовне законодавство» розуміється як законодавство України, так і
                    законодавство місця перебування Користувача/Користувачів.
                </p>
                <p>10.4 Визнання судом будь-якого положення Угоди недійсним або тим, що не підлягає примусовому
                    виконанню не тягне за собою недійсності або невиконання інших положень цієї Угоди.
                </p>


            </div>
        </div>
    }
}

const messages = defineMessages({
    pageTitle: {
        id: 'termsOfUse.pageTitle',
        defaultMessage: 'Terms of service'
    }
})

const mapStateToProps = (state, props) => {
    return {}
}

const mapDispatchToProps = {}


export default withComponentExtended('termsOfUse', [], null, {
    canonical: (params) => {
        return params;
    }
})(injectIntl(connect(mapStateToProps, mapDispatchToProps)(TermsOfUseContainer)));