'use strict';

import React from 'react';
import PropTypes from 'prop-types';
import {connect} from 'react-redux';
import {injectIntl, defineMessages, FormattedMessage} from 'react-intl';
import {withComponentExtended, withTools} from '../../../hoc';
import {messages as masterMessages} from "../../../master/masterMessages";
import Helmet from 'react-helmet';
import {messages as navigationMessages} from "../../../master/navigation/navigationMessages";
import {withRouter, Link, NavLink} from 'react-router-dom';

class PrivacyPolicyContainer extends React.Component {


    render() {
        let {intl, routeResolver} = this.props;

        return <div className="docs">
            <Helmet>
                <title>
                    {intl.formatMessage(masterMessages.pageTitle, {title: intl.formatMessage(messages.pageTitle)})}
                </title>
            </Helmet>
            <h1>{intl.formatMessage(messages.pageTitle)}</h1>
            <div>
                <h3>1. Область застосування та згода</h3>

                <p>1.1 Персональні дані фізичних осіб - користувачів сервісу Liberbee.com обробляються адміністрацією
                    Сайту. Сервіс Liberbee.com є власником Бази персональних даних користувачів Liberbee.com.</p>
                <p>1.2 Розпорядником Бази персональних даних користувачів є сайт Liberbee.com.</p>
                <p>1.3 Ця Політика конфіденційності описує встановлений Компанією порядок обробки персональних даних,
                    зібраних за допомогою Сайту www.liberbee.com і пов'язаних з ними послуг і інструментів, що
                    дозволяють користувачам реєструватися на Сайті, публікувати або переглядати в режимі реального
                    часу вже опубліковані оголошення, використовувати інший, пов'язаний з вищенаведеним сервіс
                    Liberbee.com. У всіх зазначених випадках Компанія обробляє персональні дані користувачів
                    виключно в рамках вимог Закону України «Про захист персональних даних» та Конвенції про захист
                    осіб у зв'язку з автоматизованою обробкою персональних даних.</p>
                <p>1.4 Використовуючи Сайт, Користувач надає свою згоду Компанії на обробку своїх персональних даних,
                    таких як: ім'я користувача, регіон проживання, адреса електронної пошти, інша контактна
                    інформація за бажанням користувача; ip-адреси, інші комунікаційні дані користувачів;
                    повідомлення, листи, заяви, що передаються користувачу іншими користувачами і навпаки, а також
                    дає свою згоду на передачу своїх персональних даних третім особам, в тому числі на передачу
                    персональних даних за кордон, в будь-яку третю країну, в відповідності з цією Політикою
                    конфіденційності та Угодою з користувача сервісів Liberbee.com.</p>
                <p>1.5 При переході на деякі посилання, розміщені на Сайті, користувач може бути перенаправлений до
                    сайтів (з додатками і т.д.) інших компаній за межі хостингового простору Компанії, де інформація
                    про Користувачів збирається поза прямим контролем Компанії. В такому випадку Політика
                    конфіденційності сайту регулюється згдіно положень даного сайту.</p>

                <h3>2. Інформація, яку збирає, отримує і розміщує компанія</h3>

                <p>2.1 Інформація про реєстрацію: При створенні Користувачем облікового запису на Сайті, Компанія може
                    вимагати певну інформацію, таку як дійсну адресу електронної пошти та пароль. Обліковий запис
                    включає в себе таку інформацію про них, як географічне розташування, ім'я та прізвище і супутню
                    інформацію, в тому числі фотографії, які вони можуть завантажувати в свій обліковий запис.
                    Обліковий запис дозволяє користувачам зв'язуватися один з одним, щоб висловити зацікавленість в
                    своїх пропозиціях. Користувачі несуть відповідальність за всю інформацію, що розміщується ними в
                    загальнодоступних облікових записах.</p>
                <p>2.2 Користувач повинен усвідомити всі ризики, пов'язані з тим, що він оприлюднює адресу або
                    інформацію про точне місце свого розташування. Якщо користувач вирішив увійти на Сайт,
                    використовуючи службу автентифікації стороннього оператора, наприклад інформацію Facebook чи
                    Google, Компанія може отримати додатковий профіль, або іншу інформацію, доступ до якої надано
                    такою третьою особою.</p>
                <p>2.3 Оголошення та Угоди: В рамках діяльності свого Сайту, Компанія може розміщувати інформацію, в
                    тому числі особистого і контактного характеру, необхідну для здійснення угод між покупцем і
                    продавцем, для надсилання повідомлень і спілкування користувачів між собою. Вся інформація,
                    необхідна для публікації оголошень, потрібна для створення облікового запису. Користувачі несуть
                    відповідальність за всю інформацію, що розміщується ними на Сайті. Користувач повинен уважно
                    усвідомити всі ризики, пов'язані з тим, що він оприлюднює адресу, або інформацію особистого
                    характеру.</p>
                <p>2.4 Інформація, отримана в результаті опитувань: Компанія може збирати та зберігати інформацію, що
                    отримана в результаті опитувань, що можуть проводитись Компанією, або залученими Компанією
                    підрядниками, - третіми особами.</p>
                <p>2.5 Інформація, що доступна з профайлів Користувача у багатокористувацьких Інтернет-платформах
                    (соціальних мережах): Реєструючись на Сайті, або здійснюючи вхід на Сайт за допомогою служб
                    автентифікації соціальних мереж, Користувач надає Компанії згоду на збір та обробку інформації,
                    що доступна із відповідних профайлів в соціальних мережах, а також на публікацію у відповідних
                    соціальних мережах відомостей про дії Користувача на Сайті.</p>

                <h3>3. IP-Адреса, Кукіс (cookies)</h3>

                <p>3.1 В процесі роботи Сайту Компанія може збирати певну інформацію за допомогою таких технологій як
                    кукіс (куки, cookies), пікселі (pixels) та локального сховища (у Вашому браузері).</p>
                <p>3.2 Кукіс (cookies) - це невеликі текстові файли, які зберігають інформацію безпосередньо на
                    комп'ютері користувача, його мобільному телефоні або іншому пристрої.</p>
                <p>3.3 Пікселі (pixels) - невеликі цифрові зображення, які є частиною коду на веб-сторінках, які
                    дозволяють іншому серверу вимірювати переглядання веб-сторінки, і часто використовуються в
                    поєднанні з кукіс (cookies). Код відстежує як, коли (і на якій сторінці) піксель завантажений,
                    щоб вказати, що користувач взаємодіє зі сторінкою або частиною сторінки Сайту.</p>
                <p>3.4 За допомогою кукіс (cookies), веб-сервер може зберегти, наприклад вподобання та налаштування на
                    комп'ютері Користувача або іншому пристрої(ях), яке потім автоматично відновлюється при
                    наступному відвідуванні.</p>
                <p>3.5 Компанія може дозволяти третім сторонам, таким як постачальники рекламних та/або аналітичних
                    послуг, збирати інформацію, використовуючи ці типи технологій безпосередньо на веб-сторінці
                    Сайту. Дані, які вони збирають підлягають захисту відповідно до чинної політики конфіденційності
                    цих третіх сторін.</p>

                <h3>4. Використання персональних даних</h3>

                <div>4.1 Для надання своїх послуг Компанія може використовувати інформацію, яку Компанія збирає і розміщує для наступних цілей:
                    <ul>
                        <li>забезпечення обслуговування клієнтів, в тому числі для створення і управління обліковими
                            записами користувачів, вирішення технічних труднощів і доступу до різних функцій;
                        </li>
                        <li>адаптація пропозицій і досвіду, в тому числі реклами на своїх сервісах або сервісах третіх
                            осіб;
                        </li>
                        <li>контроль загальної та індивідуальної активності користувачів, такий як пошук за ключовими
                            словами, активності за публікаціями оголошень та укладання угод, а також для управління
                            трафіком на Сайті;
                        </li>
                        <li>зв'язок з користувачами, в тому числі з питань сервісу, обслуговування клієнтів або
                            дозволених маркетингових комунікацій через будь-які доступні канали зв'язку;
                        </li>
                    </ul>
                </div>
                <p>4.2 Компанія може зберігати інформацію, яку вона збирає і отримує на своєму Сайті стільки, скільки буде потрібно для виконання вищевказаних ділових цілей.</p>
                <h3>5. Обмін інформацією</h3>
                <p>5.1 Компанія може ділитися інформацією, яку вона збирає, з афілійованими особами, розташованої в
                    будь-якій третій країні. Ці компанії можуть тільки обробляти і використовувати отримані
                    персональні дані в цілях, зазначених у п.4 цієї Політики Конфіденційності. При цьому передані
                    дані залишаються предметом цієї Політики Конфіденційності.</p>
                <div>5.2 Компанія не надає особисту інформацію користувачів не афілійованим особам, за винятком випадків,
                    коли на те є відповідний дозвіл користувачів, або за наступних обставин:
                    <ul>
                        <li>Компанія може використовувати сторонніх постачальників послуг для надання деяких складових
                            своїх послуг, в таких випадках постачальники не мають повноважень використовувати отримані
                            за допомогою Сайту Компанії персональні дані, а самі персональні дані є предметом цієї
                            Політики Конфіденційності.
                        </li>
                        <li>Компанія може надавати персональні дані користувачів на запити компетентних органів,
                            оформлених відповідно до вимог чинного законодавства, в тому числі відповідно до ст. 93
                            Кримінального процесуального кодексу України.
                        </li>
                        <li>Компанія може передавати певну знеособлену інформацію (дані, які не дозволяють
                            ідентифікувати користувачів окремо) стороннім постачальникам послуг, довіреним партнерам або
                            авторизованим дослідникам з метою кращого розуміння, яка реклама або послуги можуть
                            зацікавити користувачів, поліпшення загальної якості та ефективності послуг на Сайті або
                            сервісів, або для забезпечення свого внеску в наукові дослідження, які, на думку Компанії,
                            можуть приносити велику соціальну користь.
                        </li>
                    </ul>
                </div>
                <p>5.3 У випадках передачі персональних даних, передбачених цим розділом 5 Політики конфіденційності,
                    інформування Користувача про передачу його персональних даних залишається на розсуд
                    Компанії.</p>

                <h3>6. Користувацький контроль</h3>

                <p>6.1 Доступ, Виправлення і Вилучення: Користувачі, які створили обліковий запис, або розмістили
                    оголошення на Сайті, можуть отримувати доступ, виправляти інформацію, яку вони надають.
                    Користувач несе відповідальність за точність наданих даних, або повідомлень на Сайті.</p>
                <p>6.2 Вибір третіх осіб: деякі зовнішні суб'єкти, що діють на сайті, наприклад, Google Adwords
                    дозволяють користувачам відкликати свою згоду на збір і використання своїх даних для реклами на
                    основі активності користувачів. Для отримання більш детальної інформації та можливості вибору,
                    будь ласка, відвідайте <a target="_blank"
                                              href="http://www.networkadvertising.org">http://www.networkadvertising.org</a>.
                </p>
                <p>6.3 Кукіс (Cookies): Більшість основних комп'ютерних (десктопних) і мобільних веб-браузерів
                    (наприклад, Safari, Firefox, Internet Explorer, Chrome, Opera) забезпечують елементи управління,
                    які дозволяють користувачеві обмежити або заблокувати встановлення Кукіс (Cookies) на ваших
                    системах. Зверніть увагу, що відключення Кукіс (Cookies) щодо доменів першої категорії
                    (відвідуваних сайтів) та інших доменів (сайтів, пов'язаних з відвідуваними) може привести в
                    деяких випадках до обмеженої функціональності цих веб-сайтів.</p>

                <h3>7. Безпека</h3>

                <p>7.1 Вся інформація, яку ми збираємо в розумних межах захищена технічними засобами і процедурами
                    забезпечення безпеки з метою запобігання несанкціонованому доступу або використання даних.
                    Афілійовані з Компанією особи, надійні партнери і незалежні постачальники послуг зобов'язуються
                    використовувати отриману від Компанії інформацію відповідно до наших вимог до безпеки і цієї
                    Політикою Конфіденційності.</p>

                <h3>8. Внесення змін до цієї політики</h3>

                <p>8.1 Компанія може час від часу оновлювати цю політику конфіденційності, нова редакція Політики
                    конфіденційності вступає в силу з моменту її розміщення на Сайтіі є доступною а посиланням <Link
                        to={routeResolver.buildRouteFor('privacyPolicy', {}, {redirect: true})}>{routeResolver.buildRouteFor('privacyPolicy', {}, {absolute: true}).absolutePathname}</Link>
                </p>
                <p>8.2 У разі якщо Компанією були внесені будь-які зміни в Політику Конфіденційності, з якими Користувач
                    не згоден, він зобов'язаний припинити використання сервісів Сайту. Факт продовження використання
                    Сайту є підтвердженням згоди і прийняття Користувачем відповідної редакцією Політики
                    Конфіденційності.</p>

            </div>
        </div>
    }
}

const messages = defineMessages({
    pageTitle: {
        id: 'privacyPolicy.pageTitle',
        defaultMessage: 'Privacy policy'
    }
})

const mapStateToProps = (state, props) => {
    return {}
}

const mapDispatchToProps = {}


export default withComponentExtended('privacyPolicy', [], null, null)(injectIntl(connect(mapStateToProps, mapDispatchToProps)(PrivacyPolicyContainer)));